### Auteur: Abdelfattah Abouelaoualim
### Email: abouelaoualim.a@sfeir.com


conda install -c conda-forge ipython-sql

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [5]:
%%sql drop table if exists TRANSACT;
create table TRANSACT
(date DATETIME, order_id int, client_id int, prod_id int, prod_price float, prod_qty int)

 * sqlite://
Done.
Done.

[]

In [6]:
%%sql
insert into TRANSACT values
('01/01/19', 1234, 999, 490756, 50, 1),
('01/01/19', 1234, 999, 389728, 3.56, 4),
('02/01/19', 3456, 845, 490756, 50, 2),
('02/01/19', 3456, 845, 549380, 300, 1),
('02/01/19', 3456, 845, 293718, 10, 6),
('03/01/19', 3457, 846, 549380, 21, 11),
('03/01/19', 3458, 847, 490756, 15, 1),
('31/12/19', 3459, 848, 389728, 15, 2)

 * sqlite://
8 rows affected.

[]

In [7]:
%%sql
select * from TRANSACT

 * sqlite://
Done.

[('01/01/19', 1234, 999, 490756, 50.0, 1),
 ('01/01/19', 1234, 999, 389728, 3.56, 4),
 ('02/01/19', 3456, 845, 490756, 50.0, 2),
 ('02/01/19', 3456, 845, 549380, 300.0, 1),
 ('02/01/19', 3456, 845, 293718, 10.0, 6),
 ('03/01/19', 3457, 846, 549380, 21.0, 11),
 ('03/01/19', 3458, 847, 490756, 15.0, 1),
 ('31/12/19', 3459, 848, 389728, 15.0, 2)]

### Première partie du test

In [8]:
%%sql
select date, sum(prod_price * prod_qty) as ventes from TRANSACT
where date between '01/01/19' and '31/12/19'
group by date

 * sqlite://
Done.

[('01/01/19', 64.24),
 ('02/01/19', 460.0),
 ('03/01/19', 246.0),
 ('31/12/19', 30.0)]

In [27]:
%%sql drop table if exists PRODUCT_NOMENCLATURE;
create table PRODUCT_NOMENCLATURE
(product_id int unique, product_type varchar(50), product_name varchar(50))

 * sqlite://
Done.
Done.

[]

In [28]:
%%sql
insert into PRODUCT_NOMENCLATURE values
(490756, 'MEUBLE', 'Chaise'),
(389728, 'DECO', 'Boule de Noël'),
(549380, 'MEUBLE', 'Canapé'),
(293718, 'DECO', 'Mug')

 * sqlite://
4 rows affected.

[]

In [29]:
%%sql
select * from PRODUCT_NOMENCLATURE

 * sqlite://
Done.

[(490756, 'MEUBLE', 'Chaise'),
 (389728, 'DECO', 'Boule de Noël'),
 (549380, 'MEUBLE', 'Canapé'),
 (293718, 'DECO', 'Mug')]

### Seconde partie du test

In [79]:
%%sql
select client_id, sum(vmeuble) as ventes_meuble, sum(vdeco) as ventes_deco from (
select A.client_id,
case when B.product_type = 'MEUBLE' then A.prod_price * A.prod_qty else 0 end as 'vmeuble',
case when B.product_type = 'DECO' then A.prod_price * A.prod_qty else 0 end as 'vdeco'
from TRANSACT A
join PRODUCT_NOMENCLATURE B on B.product_id = A.prod_id
)
group by client_id

 * sqlite://
Done.

[(845, 400.0, 60.0),
 (846, 231.0, 0),
 (847, 15.0, 0),
 (848, 0, 30.0),
 (999, 50.0, 14.24)]